[{"title": "Curiosity Mars Rover's Summer Road Trip Has Begun", "preview": "After more than a year in the \"clay-bearing unit,\" Curiosity is making a mile-long journey around some deep sand so that it can explore higher up Mount Sharp."}, {"title": "Mars Scientists Investigate Ancient Life in Australia", "preview": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. "}, {"title": "Mars InSight Lander to Push on Top of the 'Mole'", "preview": "Engineers have a plan for pushing down on the heat probe, which has been stuck at the Martian surface for a year."}, {"title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"title": "The Detective Aboard NASA's Perseverance Rover", "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."}, {"title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage", "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."}, {"title": "Two of a Space Kind: Apollo 12 and Mars 2020", "preview": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."}, {"title": "NASA Mars Mission Connects With Bosnian and Herzegovinian Town", "preview": "A letter from NASA was presented to the mayor of Jezero, Bosnia-Herzegovina, honoring the connection between the town and Jezero Crater, the Mars 2020 rover landing site."}, {"title": "Mars 2020 Stands on Its Own Six Wheels", "preview": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."}, {"title": "NASA Invites Students to Name Mars 2020 Rover", "preview": "Through Nov. 1, K-12 students in the U.S. are encouraged to enter an essay contest to name NASA's next Mars rover."}, {"title": "NASA's Perseverance Mars Rover Gets Balanced", "preview": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet."}, {"title": "A New Video Captures the Science of NASA's Perseverance Mars Rover", "preview": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."}, {"title": "Three New Views of Mars' Moon Phobos", "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "NASA's Perseverance Mars Rover Gets Its Wheels and Air Brakes", "preview": "After the rover was shipped from JPL to Kennedy Space Center, the team is getting closer to finalizing the spacecraft for launch later this summer."}]